#include "desc.h"
#include"tp_cfg.h"
#include "appdesc.h"
#include "il_par.h"
# define DESC_TPCONTEXT_PARAM_VALUE                                  ((uint8_t)0)
#define kDescPrimBufferLen                                           256U
/* Used for additional information about each network */
#define kDescUsdtNetInvalidDescContext                               (uint8_t)(0xFF)
# define kDescTpNumContexts                                          1
# define DescUsdtNetStartReception(infoPool)                         (DescUsdtNetAbsStartReception((infoPool)))
/* Default setting for "response on request" (phys - yes, func - no) */
#define kDescDefaultResOnReq                                         0x01
#define kDescResOnAllReq                                             0x03
#define kDescSvcHeadNumItems                                         19U
#define kDescInvalidSvcHandle                                        (uint8_t)kDescSvcHeadNumItems
#define kDescSvcIdMapSize                                            70U
#define kDescNumSvcHeadConstGapBits                                  1U
#define kDescNumSvcHeadSessionGapBits                                3
/* SvcInst table size. */
#define kDescSvcInstNumItems                                         29
/* SvcInstHeadEx table size. */
#define kDescSvcInstHeadExtNumItems                                  22
#define kDescInvalidSvcInstHandle                                    (uint8_t)kDescSvcInstNumItems

# define V_BOOL_EXPR(exp)                                            ((uint8_t)((exp)?kDescTrue:kDescFalse))
#define kDescStateGroupNumTransition                                  9
#define kDescStateNoTransition                                       ((uint8_t)kDescStateGroupNumTransition)
#define DescOemOnValidService(iContext)                              /* Not used */
# define DescExtractResExtHeadLen(resExtHeadLen)                     (resExtHeadLen)
# define DescExtractReqExtHeadLen(reqExtHeadLen)                     (reqExtHeadLen)

# define kDescOemNrcParamIdNotSupportedInSession                     kDescNrcRequestOutOfRange

# define kDescP2InitValue                                            kDescP2Ticks
# define kDescP2ReloadValue                                          kDescP2StarTicks

#define DescActivateT2Timer(iContext)                                (g_descT2Timer[iContext] = kDescP2InitValue)

static uint16_t  g_descT2Timer[kDescNumContexts];

static uint8_t g_descBuffer[kDescTpNumContexts][kDescPrimBufferLen];
/* forward declaration of t_descUsdtNetInfoPool */
typedef struct t_descUsdtNetInfoPoolTag t_descUsdtNetInfoPool;
typedef struct t_descUsdtNetInfoPoolTag* t_descUsdtNetInfoPoolPtr;
static t_descUsdtNetResult DescUsdtNetAbsStartReception(t_descUsdtNetInfoPoolPtr infoPool);
static void DescDispatcher(void );
static uint8_t DescFindSvc(uint8_t reqSvcId);

/* Network dependent data type */
struct t_descUsdtNetInfoPoolTag
{
  t_descUsdtNetBus        busInfo;
  t_descUsdtNetReqType    reqType;
  t_descUsdtNetResType    resType;
  uint8_t                 busHandle;
  uint8_t                 descHandle;
  uint16_t                dataLength;
  uint8_t *               reqDataPtr;
  uint8_t *               resDataPtr;
};
/* ---- Context management state machine ---- */
typedef struct
{
  t_descUsdtNetResult txState;/* Tp ErrorCode */
  uint8_t         contextMode                :3;/* 0x00 - Normal, 0x01 - PIDListProcess */
  uint8_t         isApplError                :1;/* 0x00 - CANdesc NR, 0x01 - APPL NR */
  uint8_t         dummy                      :4;
} DescContextCtrl;
/* ---- Interrupt context management state machine ---- */
typedef struct
{
  t_descUsdtNetInfoPoolPtr infoPoolPtr;
  uint8_t             activity                 ;/* 0x00 - Idle, 0x01 - ActiveRx, 0x02 - ActiveProcess, 0x04 - ActiveTxSingleResponse ,0x08 - ActiveTxPeriodicRes, 0x10 - ActiveTxRoeResponder */
  uint8_t        isContextLocked        :1;
} DescInterruptContextCtrl;

typedef struct DescStateInfoTag
{
  DescStateGroup stateSession : 5;
  DescStateGroup stateSecurityAccess : 2;
  DescStateGroup stateGap_0 : 1;
} DescStateInfo;
static t_descUsdtNetInfoPool  g_descUsdtNetInfoPoolIsoTp[kDescNumContexts];
/* State machine of each received request */
static DescContextCtrl          g_descContextCtrl[kDescNumContexts];
static DescInterruptContextCtrl g_descInterruptContextCtrl[kDescNumContexts];
/* Context information to accompany the complete request processing */
static DescMsgContext     g_descMsgContext[kDescNumContexts];
/* Store the service entry index for the current request */
static uint8_t      g_descCurReqSvc[kDescNumContexts];
/* Store the instance entry index for the current request */
static uint8_t   g_descCurReqSvcInst[kDescNumContexts];
/* Store detected diagnostic error */
static DescNegResCode     g_descNegResCode[kDescNumContexts];

/* Security access sequence state */
static uint8_t                   g_descIsKeyAwaited;
static uint8_t g_descRcrrpBuffer[kDescNumContexts][3];
static DescStateInfo g_descCurState;
static void DescStateOnceInit(void);
static void DescStateOnceInit(void);
typedef struct
{
  uint8_t                reqHeadByteSpec   :8; /* Each bit represents sub-function/identifier - 0: identifier; 1: any subfunction */
  uint8_t                reqHeadExLen      :4; /* Request HeadEx length up to 7 Byte  */
  uint8_t                resHeadExLen      :4; /* Response HeadEx length up to 7 Byte */


  uint8_t             reqType           :2; /* 0x01: Phys 0x02: Func */
  uint8_t             resOnReq          :2; /* 0x01: Phys 0x02: Func */

  uint8_t             suppPosRes        :1; /* 0x00: No   0x01: Yes  */
  uint8_t             isReqHeadExtEchoed:1; /* 0x00: No   0x01: Yes  */
  uint8_t             hasSubFunction    :1; /* 0x00: No   0x01: Yes  */
  uint8_t             svcHeadPlaceHolder:kDescNumSvcHeadConstGapBits; /* Gap holder  */
  DescStateGroup          checkSessionState :kDescNumStateSession;/* State group Session on SId level */
  uint8_t             sessionPlaceHolder:kDescNumSvcHeadSessionGapBits; /* Gap holder  */

  uint8_t                  minReqLength;


/* First item in Service Instance table */
  uint8_t        svcInstFirstItem;
  uint8_t svcInstHeadExtFirstItem;
} DescSvcHead;

typedef struct
{
  uint16_t             reqLen;
  DescMsgAddInfo         msgAddInfo;
  DescStateInfo          checkState;
  uint8_t      setStateIndex;
  uint8_t   postHandlerRef;
  DescMainHandler        mainHandler;
} DescSvcInst;

/* State machine of CANdesc described by CANdelaStudio */
static uint8_t DescFindSvcInst(uint8_t * reqHeadPtr,  DescSvcHead   * pSvcHead, uint8_t* failedByteMask);
static uint8_t DescGetSvcInstHeadExtEntrySize( DescSvcHead   * pSvcHead);
